<a href="https://colab.research.google.com/github/taimbutt1233/Analysis-on-Automobile/blob/main/INEURON_ASSIGNMENT_PANDAS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [ ]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

*TASK#1: FILLING VALUES IN SPECIFIC ROWS *

In [ ]:

# PUTTING VALUES IN SPECIFIC ROWS
df.iloc[1,1]=10055
df.iloc[3,1]=10075

In [ ]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

*TASK#2: SPLITTING THE COLUMN TO MAKE TWO NEW COLUMNS*

In [ ]:
new = df["From_To"].str.split('_', n = 1, expand = True)
  
# making separate From column from new data frame
df["From"]= new[0]
  
# making separate To column from new data frame
df["To"]= new[1]

*TASK#3:DROPPING THE COLUMN(FROM_TO) *

In [ ]:
data=df.drop(['From_To'],axis=1) # DROP FROM_TO COLUMN

In [ ]:
data

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    LoNDon      paris
1       10055.0            []    <Air France> (12)    MAdrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3       10075.0          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

*TASK#4: CAPITALIZING THE COLUMN*

In [ ]:
data['From'] = data['From'].apply(lambda From : From.upper()) # CAPITALIZING
data['To']=data['To'].apply(lambda To : To.upper())

In [ ]:
data

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    LONDON      PARIS
1       10055.0            []    <Air France> (12)    MADRID      MILAN
2       10065.0  [24, 43, 87]  (British Airways. )    LONDON  STOCKHOLM
3       10075.0          [13]       12. Air France  BUDAPEST      PARIS
4       10085.0      [67, 32]          "Swiss Air"  BRUSSELS     LONDON

In [ ]:
data['RecentDelays']

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

*TASK#5: REPLACING RECENT DELAYS WITH NEW 3 COLUMNS*

In [ ]:

split_df = pd.DataFrame(data['RecentDelays'].tolist(), columns=['Delay1', 'Delay2', 'Delay3'])

data_f = pd.concat([data, split_df], axis=1)

In [ ]:
data_new=data_f.drop(['RecentDelays'],axis=1)

In [ ]:
data_new

   FlightNumber              Airline      From  ... Delay1  Delay2  Delay3
0       10045.0               KLM(!)    LONDON  ...   23.0    47.0     NaN
1       10055.0    <Air France> (12)    MADRID  ...    NaN     NaN     NaN
2       10065.0  (British Airways. )    LONDON  ...   24.0    43.0    87.0
3       10075.0       12. Air France  BUDAPEST  ...   13.0     NaN     NaN
4       10085.0          "Swiss Air"  BRUSSELS  ...   67.0    32.0     NaN

[5 rows x 7 columns]